RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_hpdf.c
/*!
    \brief      configure SPI clock source
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  clock_source: SPI clock source
                only one parameter can be selected which is shown as below:
      \arg        EXTERNAL_CKIN: external input clock
      \arg        INTERNAL_CKOUT: internal CKOUT clock
      \arg        HALF_CKOUT_FALLING_EDGE: internal CKOUT clock, sampling point on each second CKOUT falling edge
      \arg        HALF_CKOUT_RISING_EDGE: internal CKOUT clock, sampling point on each second CKOUT rising edge
    \param[out] none
    \retval     none
*/
void hpdf_spi_clock_source_config(hpdf_channel_enum channelx, uint32_t clock_source)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPICLOCK_SOURCE(clock_source)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(19), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = HPDF_CHXCTL(channelx);
        /* make sure the CHEN=0 */
        if(RESET == (reg & HPDF_CHXCTL_CHEN)) {
            reg &= ~HPDF_CHXCTL_SPICKSS;
            reg |= clock_source;
            HPDF_CHXCTL(channelx) = reg;
        }
    }
}

/*!
    \brief      configure serial interface type
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  type: serial interface type
                only one parameter can be selected which is shown as below:
      \arg        SPI_RISING_EDGE: SPI interface, sample data on rising edge
      \arg        SPI_FALLING_EDGE: SPI interface, sample data on rising edge
      \arg        MANCHESTER_CODE0: Manchester coded input: rising edge = logic 0, falling edge = logic 1
      \arg        MANCHESTER_CODE1: Manchester coded input: rising edge = logic 1, falling edge = logic 0
    \param[out] none
    \retval     none
*/
void hpdf_serial_interface_type_config(hpdf_channel_enum channelx, uint32_t type)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SERIALIF_TYPE(type)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(20), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = HPDF_CHXCTL(channelx);
        /* make sure the CHEN=0 */
        if(RESET == (reg & HPDF_CHXCTL_CHEN)) {
            reg &= ~HPDF_CHXCTL_SITYP;
            reg |= type;
            HPDF_CHXCTL(channelx) = reg;
        }
    }
}

/*!
    \brief      disable malfunction monitor
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_monitor_disable(hpdf_channel_enum channelx)
{
    HPDF_CHXCTL(channelx) &= ~HPDF_CHXCTL_MMEN;
}

/*!
    \brief      enable malfunction monitor
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_monitor_enable(hpdf_channel_enum channelx)
{
    HPDF_CHXCTL(channelx) |= HPDF_CHXCTL_MMEN;
}

/*!
    \brief      disable clock loss detector
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_clock_loss_disable(hpdf_channel_enum channelx)
{
    HPDF_CHXCTL(channelx) &= ~HPDF_CHXCTL_CKLEN;
}

/*!
    \brief      enable clock loss detector
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_clock_loss_enable(hpdf_channel_enum channelx)
{
    HPDF_CHXCTL(channelx) |= HPDF_CHXCTL_CKLEN;
}

/*!
    \brief      disable channel inputs pins redirection
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_channel_pin_redirection_disable(hpdf_channel_enum channelx)
{
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHXCTL(channelx) & HPDF_CHXCTL_CHEN)) {
        HPDF_CHXCTL(channelx) &= ~HPDF_CHXCTL_CHPINSEL;
    }
}

/*!
    \brief      enable channel inputs pins redirection
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     none
*/
void hpdf_channel_pin_redirection_enable(hpdf_channel_enum channelx)
{
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHXCTL(channelx) & HPDF_CHXCTL_CHEN)) {
        HPDF_CHXCTL(channelx) |= HPDF_CHXCTL_CHPINSEL;
    }
}

/*!
    \brief      configure channel multiplexer select input data source
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  data_source: input data source
                only one parameter can be selected which is shown as below:
      \arg        SERIAL_INPUT: input data source is taken from serial inputs
      \arg        ADC_INPUT: input data source is taken from ADC output register
      \arg        INTERNAL_INPUT: input data source is taken from internal HPDF_CHXPDI register
    \param[out] none
    \retval     none
*/
void hpdf_channel_multiplexer_config(hpdf_channel_enum channelx, uint32_t data_source)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_INPUT_DATA_SOURCE(data_source)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(27), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = HPDF_CHXCTL(channelx);
        /* make sure the CHEN=0 */
        if(RESET == (reg & HPDF_CHXCTL_CHEN)) {
            reg &= ~HPDF_CHXCTL_CMSD;
            /* configure the input data source */
            reg |= data_source;
            HPDF_CHXCTL(channelx) = reg;
        }
    }
}

/*!
    \brief      configure data packing mode
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  mode: parallel data packing mode
                only one parameter can be selected which is shown as below:
      \arg        DPM_STANDARD_MODE : standard mode
      \arg        DPM_INTERLEAVED_MODE: interleaved mode
      \arg        DPM_DUAL_MODE: dual mode
    \param[out] none
    \retval     none
*/
void hpdf_data_pack_mode_config(hpdf_channel_enum channelx, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PARADATA_PACK_MOD(mode)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(28), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = HPDF_CHXCTL(channelx);
        /* make sure the CHEN=0 */
        if(RESET == (reg & HPDF_CHXCTL_CHEN)) {
            reg &= ~HPDF_CHXCTL_DPM;
            /* configure the data packing mode */
            reg |= mode;
            HPDF_CHXCTL(channelx) = reg;
        }
    }
}

/*!
    \brief      configure data right bit-shift
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  right_shift: the number of bits that determine the right shift(0-31)
    \param[out] none
    \retval     none
*/
void hpdf_data_right_bit_shift_config(hpdf_channel_enum channelx, uint8_t right_shift)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RIGHT_SHIFT(right_shift)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(29), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        /* make sure the CHEN=0 */
        if(RESET == (HPDF_CHXCTL(channelx) & HPDF_CHXCTL_CHEN)) {
            reg = HPDF_CHXCFG0(channelx);
            reg &= ~HPDF_CHXCFG0_DTRS;
            /* configure the right shift */
            reg |= ((uint32_t)right_shift << CHXCFG_DTRS_OFFSET);
            HPDF_CHXCFG0(channelx) = reg;
        }
    }
}

/*!
    \brief      configure calibration offset
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  offset: 24-bit calibration offset, must be in (-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_calibration_offset_config(hpdf_channel_enum channelx, int32_t offset)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CALI_OFFSET(offset)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(30), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = HPDF_CHXCFG0(channelx);
        reg &= ~HPDF_CHXCFG0_CALOFF;
        /* configure the calibration offset */
        reg |= ((uint32_t)offset << CHXCFG0_CALOFF_OFFSET);
        HPDF_CHXCFG0(channelx) = reg;
    }
}

/*!
    \brief      configure malfunction monitor break signal
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  break_signal: malfunction monitor break signal distribution
                one or more parameters can be selected which is shown as below:
      \arg        NO_MM_BREAK: break signal is not distributed to malfunction monitor on channel
      \arg        MM_BREAK0: break signal 0 is distributed to malfunction monitor on channel
      \arg        MM_BREAK1: break signal 1 is distributed to malfunction monitor on channel
      \arg        MM_BREAK2: break signal 2 is distributed to malfunction monitor on channel
      \arg        MM_BREAK3: break signal 3 is distributed to malfunction monitor on channel
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_break_signal_config(hpdf_channel_enum channelx, uint32_t break_signal)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MM_BREAK_SIGNAL(break_signal)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(31), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = HPDF_CHXCFG1(channelx);
        reg &= ~HPDF_CHXCFG1_MMBSD;
        /* configure the break signal */
        reg |= break_signal;
        HPDF_CHXCFG1(channelx) = reg;
    }
}

/*!
    \brief      configure malfunction monitor counter threshold
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  threshold: malfunction monitor counter threshold(0-255)
    \param[out] none
    \retval     none
*/
void hpdf_malfunction_counter_config(hpdf_channel_enum channelx, uint8_t threshold)
{
       uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_COUNT_THRESHOLD(threshold)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(32), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {

        reg = HPDF_CHXCFG1(channelx);
        reg &= ~HPDF_CHXCFG1_MMCT;
        /* configure the malfunction monitor counter threshold */
        reg |= threshold;
        HPDF_CHXCFG1(channelx) = reg;
    }
}

/*!
    \brief      write the parallel data on standard mode of data packing
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  data: the parallel data
    \param[out] none
    \retval     none
*/
void hpdf_write_parallel_data_standard_mode(hpdf_channel_enum channelx, int16_t data)
{
    /* make sure HPDF channel is used receive parallel data */
    if(INTERNAL_INPUT == (HPDF_CHXCTL(channelx) & INTERNAL_INPUT)) {
        /* make sure the data pack of HPDF_CHXPDI register is standard mode */
        if(DPM_STANDARD_MODE == (HPDF_CHXCTL(channelx) & DPM_STANDARD_MODE)) {
            HPDF_CHXPDI(channelx) = (uint16_t)data;
        }
    }
}

/*!
    \brief      write the parallel data on interleaved mode of data packing
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  data: the parallel data
    \param[out] none
    \retval     none
*/
void hpdf_write_parallel_data_interleaved_mode(hpdf_channel_enum channelx, int32_t data)
{
    /* make sure HPDF channel is used receive parallel data */
    if(INTERNAL_INPUT == (HPDF_CHXCTL(channelx) & INTERNAL_INPUT)) {
        /* make sure the data pack of HPDF_CH0PDI register is interleaved mode */
        if(DPM_INTERLEAVED_MODE == (HPDF_CHXCTL(channelx) & DPM_INTERLEAVED_MODE)) {
            HPDF_CHXPDI(channelx) = (uint32_t)data;
        }
    }
}

/*!
    \brief      write the parallel data on dual mode of data packing
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  data: the parallel data
    \param[out] none
    \retval     none
*/
void hpdf_write_parallel_data_dual_mode(hpdf_channel_enum channelx, int32_t data)
{
    /* make sure HPDF channel is used receive parallel data */
    if(INTERNAL_INPUT == (HPDF_CHXCTL(channelx) & INTERNAL_INPUT)) {
        /* make sure the data pack of HPDF_CH0PDI register is dual mode */
        if(DPM_DUAL_MODE == (HPDF_CHXCTL(channelx) & DPM_DUAL_MODE)) {
            HPDF_CHXPDI(channelx) = (uint32_t)data;
        }
    }
}

/*!
    \brief      update the number of pulses to skip
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  number: the number of serial input samples that will be skipped
    \param[out] none
    \retval     none
*/
void hpdf_pulse_skip_update(hpdf_channel_enum channelx, uint8_t number)
{
    /* update the number of pulses to skip */
    HPDF_CHXPS(channelx) = (uint32_t)number;
}

/*!
    \brief      read the number of pulses to skip
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     the number of pulses to skip
*/
uint8_t hpdf_pulse_skip_read(hpdf_channel_enum channelx)
{
    uint8_t val;
    /* read the number of pulses to skip */
    val = (uint8_t)HPDF_CHXPS(channelx);
    return val;
}

/*!
    \brief      enable filter
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_filter_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_FLTEN;
}

/*!
    \brief      disable filter
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_filter_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_FLTEN;
}

/*!
    \brief      configure sinc filter order and oversample
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  order: sinc filter order
                only one parameter can be selected which is shown as below:
      \arg        FLT_FASTSINC: FastSinc filter type
      \arg        FLT_SINC1: Sinc1 filter type
      \arg        FLT_SINC2: Sinc2 filter type
      \arg        FLT_SINC3: Sinc3 filter type
      \arg        FLT_SINC4: Sinc4 filter type
      \arg        FLT_SINC5: Sinc5 filter type
    \param[in]  oversample: Sinc filter oversampling rate(1-1024)
    \param[out] none
    \retval     none
*/
void hpdf_filter_config(hpdf_filter_enum filtery, uint32_t order, uint16_t oversample)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FILTER_ORDER(order)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(40), ERR_PARAM_INVALID);
    } else if (NOT_OVERSAMPLE(oversample)){
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(40), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        /* make sure the FLTEN=0 */
        if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
            reg = HPDF_FLTYSFCFG(filtery);
            reg &= ~(HPDF_FLTYSFCFG_SFO | HPDF_FLTYSFCFG_SFOR);
            /* configure the sinc filter order and oversample */
            reg |= (order | (((uint32_t)oversample - 1U) << FLTYSFCFG_SFOR_OFFSET));
            HPDF_FLTYSFCFG(filtery) = reg;
        }
    }
}

/*!
    \brief      configure integrator oversampling rate
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  oversample: integrator oversampling rate(1-256)
    \param[out] none
    \retval     none
*/
void hpdf_integrator_oversample(hpdf_filter_enum filtery, uint16_t oversample)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_INTER_OVERSAMPLE(oversample)){
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(41), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        /* make sure the FLTEN=0 */
        if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
            reg = HPDF_FLTYSFCFG(filtery);
            reg &= ~HPDF_FLTYSFCFG_IOR;
            /* configure the integrator oversampling rate */
            reg |= (uint32_t)oversample - 1U;
            HPDF_FLTYSFCFG(filtery) = reg;
        }
    }
}

/*!
    \brief      configure threshold monitor filter order and oversample
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[in]  order: threshold monitor Sinc filter order
                only one parameter can be selected which is shown as below:
      \arg        TM_FASTSINC: FastSinc filter type
      \arg        TM_SINC1: Sinc1 filter type
      \arg        TM_SINC2: Sinc2 filter type
      \arg        TM_SINC3: Sinc3 filter type
    \param[in]  oversample: Sinc filter oversampling rate(1-32)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_filter_config(hpdf_channel_enum channelx, uint32_t order, uint8_t oversample)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TM_ORDER(order)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(42), ERR_PARAM_INVALID);
    } else if (NOT_TM_OVERSAMPLE(oversample)){
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(42), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        /* make sure the CHEN=0 */
        if(RESET == (HPDF_CHXCTL(channelx) & HPDF_CHXCTL_CHEN)) {
            reg = HPDF_CHXCFG1(channelx);
            reg &= ~(HPDF_CHXCFG1_TMSFO | HPDF_CHXCFG1_TMFOR);
            /* configure the threshold monitor filter order and oversample rate */
            reg |= (order | (((uint32_t)oversample - 1U) << CHXCFG1_TMFOR_OFFSET));
            HPDF_CHXCFG1(channelx) = reg;
        }
    }
}

/*!
    \brief      read the threshold monitor filter data
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     the threshold monitor filter data
*/
int16_t hpdf_threshold_monitor_filter_read_data(hpdf_channel_enum channelx)
{
    int16_t val;
    val = (int16_t)HPDF_CHXTMFDT(channelx);
    return val;
}

/*!
    \brief      disable threshold monitor fast mode
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_fast_mode_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_TMFM;
}

/*!
    \brief      enable threshold monitor fast mode
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_fast_mode_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_TMFM;
}

/*!
    \brief      configure threshold monitor channel
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  channel: which channel use threshold monitor y(x=0,3)
                one or more parameters can be selected which is shown as below:
      \arg        TMCHEN_DISABLE: threshold monitor y is disabled on all channel
      \arg        TMCHEN_CHANNELx(x=0..7) threshold monitor is enabled on channel x
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_channel(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TM_CHANNEL(channel)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(46), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = HPDF_FLTYCTL1(filtery);
        reg &= ~HPDF_FLTYCTL1_TMCHEN;
        /* configure the channel which threshold monitor watch on */
        reg |= channel;
        HPDF_FLTYCTL1(filtery) = reg;
    }
}

/*!
    \brief      configure threshold monitor high threshold value
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  value: high threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_high_threshold(hpdf_filter_enum filtery, int32_t value)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TM_VALUE(value)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(47), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = HPDF_FLTYTMHT(filtery);
        reg &= ~HPDF_FLTYTMHT_HTVAL;
        /* write the signed value */
        reg |= (uint32_t)value << FLTYTMHT_HTVAL_OFFSET;
        HPDF_FLTYTMHT(filtery) = reg;
    }
}

/*!
    \brief      configure threshold monitor low threshold value
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  value: low threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_low_threshold(hpdf_filter_enum filtery, int32_t value)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TM_VALUE(value)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(48), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = HPDF_FLTYTMLT(filtery);
        reg &= ~HPDF_FLTYTMLT_LTVAL;
        /* write the signed value */
        reg |= (uint32_t)value << FLTYTMLT_LTVAL_OFFSET;
        HPDF_FLTYTMLT(filtery) = reg;
    }
}

/*!
    \brief      configure threshold monitor high threshold event break signal
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  break_signal: HPDF break signal
                one or more parameters can be selected which is shown as below:
      \arg        NO_TM_HT_BREAK: break signal is not distributed to an threshold monitor high threshold event
      \arg        TM_HT_BREAKx(x=0..3): break signal x is distributed to an threshold monitor high threshold event
    \param[out] none
    \retval     none
*/
void hpdf_high_threshold_break_signal(hpdf_filter_enum filtery, uint32_t break_signal)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TM_BREAK_SIGNAL(break_signal)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(49), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = HPDF_FLTYTMHT(filtery);
        reg &= ~HPDF_FLTYTMHT_HTBSD;
        /* configure the break signal */
        reg |= break_signal;
        HPDF_FLTYTMHT(filtery) = reg;
    }
}

/*!
    \brief      configure threshold monitor low threshold event break signal
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  break_signal: the HPDF break signal
                one or more parameters can be selected which is shown as below:
      \arg        NO_TM_LT_BREAK: break signal is not distributed to an threshold monitor low threshold event
      \arg        TM_LT_BREAKx(x=0..3): break signal x is distributed to an threshold monitor low threshold event
    \param[out] none
    \retval     none
*/
void hpdf_low_threshold_break_signal(hpdf_filter_enum filtery, uint32_t break_signal)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TM_BREAK_SIGNAL(break_signal)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(50), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
      reg = HPDF_FLTYTMLT(filtery);
      reg &= ~HPDF_FLTYTMLT_LTBSD;
      /* configure the break signal */
      reg |= break_signal;
      HPDF_FLTYTMLT(filtery) = reg;
    }
}

/*!
    \brief      configure extremes monitor channel
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  channel: which channel use extremes monitor
                one or more parameters can be selected which is shown as below:
      \arg        EM_CHANNEL_DISABLE: extremes monitor y does not accept data from any channel
      \arg        EM_CHANNELx(x=0..7): extremes monitor accepts data from channel x
    \param[out] none
    \retval     none
*/
void hpdf_extremes_monitor_channel(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EM_CHANNEL(channel)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(51), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = HPDF_FLTYCTL1(filtery);
        reg &= ~HPDF_FLTYCTL1_EMCS;
        /* configure the channel which channel use extremes monitor */
        reg |= channel;
        HPDF_FLTYCTL1(filtery) = reg;
    }
}

/*!
    \brief      get the extremes monitor maximum value
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     the maximum value
*/
int32_t hpdf_extremes_monitor_maximum_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the maximum value */
    val = HPDF_FLTYEMMAX(filtery) >> FLTYEMMAX_MAXVAL_OFFSET;
    /* get the sign of value */
    if(val & SIGN_BIT_OFFSET) {
        val |= 0xFF000000U;
    }
    return (int32_t)val;
}

/*!
    \brief      get the extremes monitor minimum value
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     the minimum value
*/
int32_t hpdf_extremes_monitor_minimum_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the channel of maximum value */
    val = HPDF_FLTYEMMIN(filtery) >> FLTYEMMIN_MINVAL_OFFSET;
    /* get the sign of vlaue */
    if(val & SIGN_BIT_OFFSET) {
        val |= 0xFF000000U;
    }
    return (int32_t)val;
}

